JUMA-IO/STM32_Platform/system/bsp/jumawatch/bsp_common.c
  /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initialize the BUS */
    SPIx_Error();
  }
  
  return readvalue;
}

/**
  * @brief  Writes a byte to device.
  * @param  Value: value to be written
  * @retval None
  */
static void SPIx_Write(uint16_t Value)
{
  HAL_StatusTypeDef status = HAL_OK;
  
  status = HAL_SPI_Transmit(&SpiHandle, (uint8_t*) &Value, 1, SpixTimeout);
  
  /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initialize the BUS */
    SPIx_Error();
  }
}

/**
  * @brief  Sends a Byte through the SPI interface and return the Byte received 
  *         from the SPI bus.
  * @param  Byte: Byte send.
  * @retval The received byte value
  */
static uint8_t SPIx_WriteRead(uint8_t Byte)
{
  uint8_t receivedbyte = 0;
  
  /* Send a Byte through the SPI peripheral */
  /* Read byte from the SPI bus */
  if(HAL_SPI_TransmitReceive(&SpiHandle, (uint8_t*) &Byte, (uint8_t*) &receivedbyte, 1, SpixTimeout) != HAL_OK)
  {
    SPIx_Error();
  }
  
  return receivedbyte;
}

/**
  * @brief  SPIx error treatment function.
  * @param  None
  * @retval None
  */
static void SPIx_Error(void)
{
  /* De-initialize the SPI communication BUS */
  HAL_SPI_DeInit(&SpiHandle);
  
  /* Re- Initialize the SPI communication BUS */
  SPIx_Init();
}

/**
  * @brief  SPI MSP Init.
  * @param  hspi: SPI handle
  * @retval None
  */
static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
{
  GPIO_InitTypeDef   GPIO_InitStructure;
  
  if(hspi->Instance==DISCOVERY_SPIx){
      /* Enable SPIx clock */
      DISCOVERY_SPIx_CLK_ENABLE();

      /* Enable DISCOVERY_SPI GPIO clock */
      DISCOVERY_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();
      DISCOVERY_SPIx_SCK_GPIO_CLK_ENABLE();
      DISCOVERY_SPIx_CS_GPIO_CLK_ENABLE();

      /* MOSI*/    
      GPIO_InitStructure.Pin    = DISCOVERY_SPIx_MOSI_PIN;
      GPIO_InitStructure.Mode   = GPIO_MODE_AF_PP;
      GPIO_InitStructure.Pull   = GPIO_NOPULL;
      GPIO_InitStructure.Speed  = GPIO_SPEED_HIGH;
      GPIO_InitStructure.Alternate = DISCOVERY_SPIx_AF;
      HAL_GPIO_Init(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStructure);
      /*sck*/
      GPIO_InitStructure.Pin   = DISCOVERY_SPIx_SCK_PIN;
      GPIO_InitStructure.Pull   = GPIO_PULLDOWN;
      HAL_GPIO_Init(DISCOVERY_SPIx_SCK_GPIO_PORT, &GPIO_InitStructure);
      /*cs*/
      GPIO_InitStructure.Pin   = DISCOVERY_SPIx_CS_PIN;
      GPIO_InitStructure.Pull   = GPIO_PULLUP;
      GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
      HAL_GPIO_Init(DISCOVERY_SPIx_CS_GPIO_PORT, &GPIO_InitStructure);
      HAL_GPIO_WritePin(DISCOVERY_SPIx_CS_GPIO_PORT, DISCOVERY_SPIx_CS_PIN, GPIO_PIN_SET);
 }
  
}

/********************************* LINK LCD ***********************************/

/**
  * @brief  Configures the LCD_SPI interface.
  * @param  None
  * @retval None
  */
void LCD_IO_Init(void)
{
  GPIO_InitTypeDef   GPIO_InitStructure;
  
  LCD_RESET_GPIO_CLK_ENABLE() ;
 
  /* LCD RST*/    
  GPIO_InitStructure.Pin    = LCD_RESET_PIN;
  GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull   = GPIO_PULLUP;
  GPIO_InitStructure.Speed  = GPIO_SPEED_LOW;
  GPIO_InitStructure.Alternate = 0;
  HAL_GPIO_Init(LCD_RESET_GPIO_PORT, &GPIO_InitStructure);
	
	DISCOVERY_SPIx_CS_GPIO_CLK_ENABLE(); 
	GPIO_InitStructure.Pin    = GPIO_PIN_10;
	GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull   = GPIO_PULLUP;
	GPIO_InitStructure.Speed  = GPIO_SPEED_HIGH;
	GPIO_InitStructure.Alternate = 0;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	DISCOVERY_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();
	GPIO_InitStructure.Pin    = GPIO_PIN_6;
	GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull   = GPIO_PULLUP;
	GPIO_InitStructure.Speed  = GPIO_SPEED_HIGH;
	GPIO_InitStructure.Alternate = 0;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	 /* Enable DISCOVERY_SPI GPIO clock */
  DISCOVERY_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();
  DISCOVERY_SPIx_SCK_GPIO_CLK_ENABLE();
  DISCOVERY_SPIx_CS_GPIO_CLK_ENABLE();

  /* MOSI*/    
  GPIO_InitStructure.Pin    = DISCOVERY_SPIx_MOSI_PIN;
  GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull   = GPIO_NOPULL;
  GPIO_InitStructure.Speed  = GPIO_SPEED_HIGH;
  GPIO_InitStructure.Alternate = 0;
  HAL_GPIO_Init(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStructure);
  /*sck*/
  GPIO_InitStructure.Pin   = DISCOVERY_SPIx_SCK_PIN;
	GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull   = GPIO_PULLDOWN;
  HAL_GPIO_Init(DISCOVERY_SPIx_SCK_GPIO_PORT, &GPIO_InitStructure);
  /*cs*/
  GPIO_InitStructure.Pin   = DISCOVERY_SPIx_CS_PIN;
	GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull   = GPIO_PULLUP;
  HAL_GPIO_Init(DISCOVERY_SPIx_CS_GPIO_PORT, &GPIO_InitStructure);
  HAL_GPIO_WritePin(DISCOVERY_SPIx_CS_GPIO_PORT, DISCOVERY_SPIx_CS_PIN, GPIO_PIN_SET);
  /*spi3*/
  //SPIx_Init();
}

/**
  * @brief  Writes register value.
  * @param  None
  * @retval None
  */
void LCD_IO_WriteData(uint8_t RegValue) 
{
	uint8_t tmp,RegValue1 ;
//	tmp = (RegValue << 7) & 0x80;
//	RegValue = ((RegValue >> 1) & (~0x80)) | (0x80);
//  /* Reset LCD control line(/CS) and Send data */  
//  LCD_CS_LOW();
//  //LCD_SDA_HIGH();
//	SPIx_Write(RegValue);
//  SPIx_Write(tmp);
//  
//  /* Deselect: Chip Select high */
//  LCD_CS_HIGH();
//		
//		RegValue1 |= (RegValue  << 7)& 0x80;
//		RegValue1 |= (RegValue  << 6)& 0x40;
//		RegValue1 |= (RegValue  << 5)& 0x20;
//		RegValue1 |= (RegValue  << 4)& 0x10;
//		RegValue1 |= (RegValue  << 3)& 0x08;
//		RegValue1 |= (RegValue  << 2)& 0x04;
//		RegValue1 |= (RegValue  << 1)& 0x02;
//		RegValue1 |= (RegValue  << 0)& 0x01;
		LCD_CS_LOW();
		HAL_GPIO_WritePin(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT,DISCOVERY_SPIx_MOSI_PIN,0x01);
		HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x01);
		HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x00);
	
		for(tmp = 0; tmp < 8; tmp++){
				HAL_GPIO_WritePin(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT,DISCOVERY_SPIx_MOSI_PIN,(RegValue >> (7-tmp))&0x01);
				HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x01);
				HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x00);
		}
		LCD_CS_HIGH();
}

/**
  * @brief  Writes register address.
  * @param  None
  * @retval None
  */
void LCD_IO_WriteReg(uint8_t Reg) 
{
	
	uint8_t tmp,RegValue1;
//	tmp = (Reg << 7) & 0x80;
//	Reg = (Reg >> 1) & (~0x80);
//	
//  LCD_CS_LOW();
//  //LCD_SDA_LOW();
//  SPIx_Write(Reg);
//	SPIx_Write(tmp);
//  
//  /* Deselect: Chip Select high */
//  LCD_CS_HIGH();
//		RegValue1 |= (Reg  << 7)& 0x80;
//		RegValue1 |= (Reg  << 6)& 0x40;
//		RegValue1 |= (Reg  << 5)& 0x20;
//		RegValue1 |= (Reg  << 4)& 0x10;
//		RegValue1 |= (Reg  << 3)& 0x08;
//		RegValue1 |= (Reg  << 2)& 0x04;
//		RegValue1 |= (Reg  << 1)& 0x02;
//		RegValue1 |= (Reg  << 0)& 0x01;
		LCD_CS_LOW();
		HAL_GPIO_WritePin(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT,DISCOVERY_SPIx_MOSI_PIN,0x00);
		HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x01);
		HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x00);
	
		for(tmp = 0; tmp < 8; tmp++){
				HAL_GPIO_WritePin(DISCOVERY_SPIx_MISO_MOSI_GPIO_PORT,DISCOVERY_SPIx_MOSI_PIN,(Reg >> (7-tmp))&0x01);
				HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x01);
				HAL_GPIO_WritePin(DISCOVERY_SPIx_SCK_GPIO_PORT,DISCOVERY_SPIx_SCK_PIN,0x00);
		}
		LCD_CS_HIGH();
}

